package proj.service.impl;

import java.util.ArrayList;
import java.util.List;

import org.apache.log4j.Logger;
import org.springframework.stereotype.Service;

import proj.controller.IndexConntroller;
import proj.domain.Product;
import proj.service.ProductService;

@Service
public class ProductServiceImpl implements ProductService {

	private static final Logger logger = Logger.getLogger(ProductServiceImpl.class);
	
	@Override
	public List<Product> getProducts() {
		logger.debug("getProducts");
		List<Product> result = new ArrayList<Product>();
		result.add(new Product(
				"1",
				"春：雙龍禮盒",
				"行家即食燕盞(2入)：<br/>老行家即食行家燕盞精選頂級燕盞燉煮製成，帶有淡淡的蛋白清香，入口後滑嫩爽口，享受如皇室宮廷般的尊貴養生食材。<br/>行家即食燕盞<br/>建議食用方式: 每天早晚各一湯匙，每瓶約可食用16天。本產品需冷藏保存. (更建議您避免放置於冰箱門旁邊,因為家用冰箱開開關關,容易讓燕盞因為儲存溫度變化,造成變質。) <br/>本產品為純天然食品，均不含人工添加物，燕盞中有細微點狀物純屬正常現象，敬請安心食用。 <br/>即飲冰糖燕盞(3入)：<br/>新鮮即時養生即飲精選極品上等燕盞，調和冰糖滑順風味，口感厚實飽足又爽口，內含15g固形物燕窩，每一口都實在、新鮮吃得到，健康不需久藏，養生就是要即時嚐鮮！ <br/>即飲冰糖燕盞<br/>食用方式 :冷藏儲存於0℃～4℃，開封後請立即食用.<br/>有效期限：30~45天(請注意瓶身上效期，現煮無添加任何防腐劑) 贈品贈品：玻尿酸面膜或熊果素面膜２盒隨機贈送。",
				"/res/img/product/product1.jpg", "(行家即食燕盞)"));
		result.add(new Product(
				"2",
				"行家即食燕盞＋燕窩膠原蛋白",
				"老行家行家即食燕盞精選頂級燕盞燉煮製成，帶有淡淡的蛋白清香，入口後滑嫩爽口，享受如皇室宮廷般的尊貴養生食材。<br/>老行家燕盞<br/>建議食用方式 每天早晚各一湯匙，每瓶約可食用14~15天。本產品\"需冷藏保存\". (更建議您避免放置於冰箱門旁邊,因為家用冰箱開開關關,容易讓燕盞因為儲存溫度變化,造成變質。) <br/>本產品為純天然食品，均不含人工添加物，燕盞中有細微點狀物純屬正常現象，敬請安心食用。 <br/>有效期限：30~45天(請注意瓶身上效期，現煮無添加任何防腐劑) <br/>燕窩膠原蛋白萃取濃縮精華，吸收滿滿的美麗元素，由內而外養顏美容。 ",
				"/res/img/product/product2.jpg", "(禮盒裝)"));
		result.add(new Product(
				"3",
				"孕婦專案-三馨二益",
				"《三馨二益》寵愛孕媽咪專案三樣產品，每日食用二次，提供準媽媽們在懷孕期間所需的營養補給 <br/>行家即食燕盞(350g):老行家即食行家燕盞精選頂級燕盞燉煮製成，帶有淡淡的蛋白清香，入口後滑嫩爽口，享受如皇室宮廷般的尊貴養生食材。老行家燕盞建議食用方式 每天早晚各一湯匙，每瓶約可食用16天。本產品\"需冷藏保存\"(更建議您避免放置於冰箱門旁邊,因為家用冰箱開開關關,容易讓燕盞因為儲存溫度變化,造成變質。) 本產品為純天然食品，均不含人工添加物，燕盞中有細微點狀物純屬正常現象，敬請安心食用。  容量：350g 成分:燕窩、水、冰糖 使用方式：早晚空腹一湯匙",
				"/res/img/product/product3.png", "(燕盞+珍珠粉+益生菌)"));
		result.add(new Product(
				"1",
				"春：雙龍禮盒",
				"行家即食燕盞(2入)：<br/>老行家即食行家燕盞精選頂級燕盞燉煮製成，帶有淡淡的蛋白清香，入口後滑嫩爽口，享受如皇室宮廷般的尊貴養生食材。<br/>行家即食燕盞<br/>建議食用方式: 每天早晚各一湯匙，每瓶約可食用16天。本產品需冷藏保存. (更建議您避免放置於冰箱門旁邊,因為家用冰箱開開關關,容易讓燕盞因為儲存溫度變化,造成變質。) <br/>本產品為純天然食品，均不含人工添加物，燕盞中有細微點狀物純屬正常現象，敬請安心食用。 <br/>即飲冰糖燕盞(3入)：<br/>新鮮即時養生即飲精選極品上等燕盞，調和冰糖滑順風味，口感厚實飽足又爽口，內含15g固形物燕窩，每一口都實在、新鮮吃得到，健康不需久藏，養生就是要即時嚐鮮！ <br/>即飲冰糖燕盞<br/>食用方式 :冷藏儲存於0℃～4℃，開封後請立即食用.<br/>有效期限：30~45天(請注意瓶身上效期，現煮無添加任何防腐劑) 贈品贈品：玻尿酸面膜或熊果素面膜２盒隨機贈送。",
				"/res/img/product/product1.jpg", "(行家即食燕盞)"));
		result.add(new Product(
				"2",
				"行家即食燕盞＋燕窩膠原蛋白",
				"老行家行家即食燕盞精選頂級燕盞燉煮製成，帶有淡淡的蛋白清香，入口後滑嫩爽口，享受如皇室宮廷般的尊貴養生食材。<br/>老行家燕盞<br/>建議食用方式 每天早晚各一湯匙，每瓶約可食用14~15天。本產品\"需冷藏保存\". (更建議您避免放置於冰箱門旁邊,因為家用冰箱開開關關,容易讓燕盞因為儲存溫度變化,造成變質。) <br/>本產品為純天然食品，均不含人工添加物，燕盞中有細微點狀物純屬正常現象，敬請安心食用。 <br/>有效期限：30~45天(請注意瓶身上效期，現煮無添加任何防腐劑) <br/>燕窩膠原蛋白萃取濃縮精華，吸收滿滿的美麗元素，由內而外養顏美容。 ",
				"/res/img/product/product2.jpg", "(禮盒裝)"));
		result.add(new Product(
				"3",
				"孕婦專案-三馨二益",
				"《三馨二益》寵愛孕媽咪專案三樣產品，每日食用二次，提供準媽媽們在懷孕期間所需的營養補給 <br/>行家即食燕盞(350g):老行家即食行家燕盞精選頂級燕盞燉煮製成，帶有淡淡的蛋白清香，入口後滑嫩爽口，享受如皇室宮廷般的尊貴養生食材。老行家燕盞建議食用方式 每天早晚各一湯匙，每瓶約可食用16天。本產品\"需冷藏保存\"(更建議您避免放置於冰箱門旁邊,因為家用冰箱開開關關,容易讓燕盞因為儲存溫度變化,造成變質。) 本產品為純天然食品，均不含人工添加物，燕盞中有細微點狀物純屬正常現象，敬請安心食用。  容量：350g 成分:燕窩、水、冰糖 使用方式：早晚空腹一湯匙",
				"/res/img/product/product3.png", "(燕盞+珍珠粉+益生菌)"));

		return result;
	}
}
